malleability.org
#+OPTIONS: num:nil toc:nil reveal_title_slide:nil
* On Kotlin's Malleability
Or how I learned to write Kotlin and Make A Lisp
* Kotlin is like Java but good
** Give me functions!
   #+BEGIN_SRC kotlin
   fun emptyMalList() = MalList(listOf())
   fun malListOf(vararg elems: MalType) = malListOf(elems.asList())
   fun malListOf(elems: List<MalType>) = MalList(elems)
   #+END_SRC
** Expressions are expressive
   #+BEGIN_SRC kotlin
   it.atoms.slice(2 .. (if(it.size > 2) it.size - 1 else 1))
   #+END_SRC
   i.e when do you want a statement outside of a declaration?
** Fewer characters, moar power
   #+BEGIN_SRC kotlin
   private fun compare_lists(a: MalSeq, b: MalSeq): Boolean =
      a.atoms.count() == b.atoms.count() &&
      a.atoms.indices.all { is_equal(a[it], b[it]) }
   #+END_SRC
** Data is more like data
   #+BEGIN_SRC kotlin
   data class MalString(val str: String) : MalKey
   data class MalKeyword(val kw: String) : MalKey

   data class MalAtom(var value : MalType) : MalType
   #+END_SRC
* Plays well with JVM
  Which means it compiles fast and makes Java interop pleasant.
** What is the JVM but an abstraction over the silicon substrate?
   #+BEGIN_SRC asm
; Define variables in the data section
SECTION .DATA
	hello:     db 'Hello world!',10
	helloLen:  equ $-hello

; Code goes in the text section
SECTION .TEXT
	GLOBAL _start 

_start:
	mov eax,4            ; 'write' system call = 4
	mov ebx,1            ; file descriptor 1 = STDOUT
	mov ecx,hello        ; string to write
	mov edx,helloLen     ; length of string to write
	int 80h              ; call the kernel

	; Terminate program
	mov eax,1            ; 'exit' system call
	mov ebx,0            ; exit with error code 0
	int 80h              ; call the kernel
   #+END_SRC
** Look familiar?
#+REVEAL_HTML: <small>
   #+BEGIN_SRC asm
class Hello {
  Hello();
    Code:
       0: aload_0
       1: invokespecial #1  // Method java/lang/Object."<init>":()V
       4: return

  int main();
    Code:
       0: getstatic     #7  // Field java/lang/System.out:Ljava/io/PrintStream;
       3: ldc           #13 // String hello, world!
       5: invokevirtual #15 // Method java/io/PrintStream.println:(Ljava/lang/String;)V
       8: iconst_0
       9: ireturn
}
   #+END_SRC
#+REVEAL_HTML: </small>
** Also it is made of software
   https://hg.openjdk.java.net/jdk/jdk15/file/b9e3a25945f0
   #+REVEAL_HTML: <small>
   #+BEGIN_SRC c++
   void ClassFileParser::parse_constant_pool_entries(const ClassFileStream* const stream,
                                                  ConstantPool* cp,
                                                  const int length,
                                                  TRAPS) {
   ...
   #+END_SRC
   #+REVEAL_HTML: </small>
   via [[https://hg.openjdk.java.net/jdk/jdk15/file/b9e3a25945f0/src/hotspot/share/classfile/classFileParser.cpp][src/hotspot/share/classfile/classFileParser.cpp]]
** Lets do that again but in Kotlin
   Which is [[https://github.com/JetBrains/kotlin/tree/master/compiler/backend/src/org/jetbrains/kotlin/codegen][_mostly_ self-hosting]]!
   #+BEGIN_SRC kotlin
   class TailRecursionCodegen(
      private val context: MethodContext,
      private val codegen: ExpressionCodegen,
      private val v: InstructionAdapter,
      private val state: GenerationState
   ) {
   #+END_SRC
* Mal in kotlin
 *Caveat* — This was a learning exercise, shonky code ahead!
** Features of Kotlin used in Mal …
***  Safe casting with polymorphic objects (so useful!)
       #+BEGIN_SRC kotlin
       when(seq) {
           is MalList   -> malListOf(rest.reversed() + seq.atoms)
           else         -> MalVector(seq.atoms + rest)
       }
       #+END_SRC
***  Functions all the things
       #+BEGIN_SRC kotlin
       fun READ(s: String) = read_str(s)
       #+END_SRC
