malleability.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8"/>
<title></title>
<meta name="author" content="(Daniel Brook)"/>
<link rel="stylesheet" href="https://cdn.jsdelivr.net/npm/reveal.js/dist/reveal.css"/>

<link rel="stylesheet" href="https://cdn.jsdelivr.net/npm/reveal.js/dist/theme/moon.css" id="theme"/>


<!-- If the query includes 'print-pdf', include the PDF print sheet -->
</head>
<body>
<div class="reveal">
<div class="slides">
<section>
<section id="slide-org9e6be53">
<h2 id="org9e6be53">On Kotlin's Malleability</h2>
<p>
Or how I learned to write Kotlin and Make A Lisp
</p>
</section>
</section>
<section>
<section id="slide-org7229d57">
<h2 id="org7229d57">Kotlin is like Java but good</h2>
<div class="outline-text-2" id="text-org7229d57">
</div>
</section>
<section id="slide-org7b14455">
<h3 id="org7b14455">Give me functions!</h3>
<div class="org-src-container">

<pre  class="src src-kotlin"><code trim><span style="color: #66D9EF;">fun</span> <span style="color: #F92672; font-style: italic;">emptyMalList</span>() = <span style="color: #66D9EF;">MalList</span>(listOf())
<span style="color: #66D9EF;">fun</span> <span style="color: #F92672; font-style: italic;">malListOf</span>(<span style="color: #66D9EF;">vararg</span> elems: <span style="color: #66D9EF;">MalType</span>) = malListOf(elems.asList())
<span style="color: #66D9EF;">fun</span> <span style="color: #F92672; font-style: italic;">malListOf</span>(elems: <span style="color: #66D9EF;">List&lt;MalType&gt;</span>) = <span style="color: #66D9EF;">MalList</span>(elems)
</code></pre>
</div>
</section>
<section id="slide-org2c94a87">
<h3 id="org2c94a87">Expressions are expressive</h3>
<div class="org-src-container">

<pre  class="src src-kotlin"><code trim><span style="color: #66D9EF;">it</span>.atoms.slice(2 .. (<span style="color: #66D9EF;">if</span>(<span style="color: #66D9EF;">it</span>.size &gt; 2) <span style="color: #66D9EF;">it</span>.size - 1 <span style="color: #66D9EF;">else</span> 1))
</code></pre>
</div>
<p>
i.e when do you want a statement outside of a declaration?
</p>
</section>
<section id="slide-org2e4acb6">
<h3 id="org2e4acb6">Fewer characters, moar power</h3>
<div class="org-src-container">

<pre  class="src src-kotlin"><code trim><span style="color: #66D9EF;">private</span> <span style="color: #66D9EF;">fun</span> <span style="color: #F92672; font-style: italic;">compare_lists</span>(a: <span style="color: #66D9EF;">MalSeq</span>, b: <span style="color: #66D9EF;">MalSeq</span>): <span style="color: #66D9EF;">Boolean</span> =
   a.atoms.count() == b.atoms.count() &amp;&amp;
   a.atoms.indices.all { is_equal(a[<span style="color: #66D9EF;">it</span>], b[<span style="color: #66D9EF;">it</span>]) }
</code></pre>
</div>
</section>
<section id="slide-org47cc5fb">
<h3 id="org47cc5fb">Data is more like data</h3>
<div class="org-src-container">

<pre  class="src src-kotlin"><code trim><span style="color: #66D9EF;">data</span> <span style="color: #66D9EF;">class</span> <span style="color: #66D9EF;">MalString</span>(<span style="color: #66D9EF;">val</span> <span style="color: #F92672;">str</span>: <span style="color: #66D9EF;">String</span>) : <span style="color: #66D9EF;">MalKey</span>
<span style="color: #66D9EF;">data</span> <span style="color: #66D9EF;">class</span> <span style="color: #66D9EF;">MalKeyword</span>(<span style="color: #66D9EF;">val</span> <span style="color: #F92672;">kw</span>: <span style="color: #66D9EF;">String</span>) : <span style="color: #66D9EF;">MalKey</span>

<span style="color: #66D9EF;">data</span> <span style="color: #66D9EF;">class</span> <span style="color: #66D9EF;">MalAtom</span>(<span style="color: #66D9EF;">var</span> <span style="color: #F92672;">value</span> : <span style="color: #66D9EF;">MalType</span>) : <span style="color: #66D9EF;">MalType</span>
</code></pre>
</div>
</section>
</section>
<section>
<section id="slide-orgb9f2650">
<h2 id="orgb9f2650">Plays well with JVM</h2>
<p>
Which means it compiles fast and makes Java interop pleasant.
</p>
</section>
<section id="slide-org63f19f5">
<h3 id="org63f19f5">What is the JVM but an abstraction over the silicon substrate?</h3>
<div class="org-src-container">

<pre  class="src src-asm"><code trim><span style="color: #465457; font-style: italic;">; </span><span style="color: #4876ff; font-style: italic;">Define variables in the data section</span>
<span style="color: #F92672; font-style: italic;">SECTION</span> .DATA
        <span style="color: #66D9EF;">hello</span>:     db 'Hello world!',10
        <span style="color: #66D9EF;">helloLen</span>:  equ $-hello

<span style="color: #465457; font-style: italic;">; </span><span style="color: #4876ff; font-style: italic;">Code goes in the text section</span>
<span style="color: #F92672; font-style: italic;">SECTION</span> .TEXT
        <span style="color: #66D9EF;">GLOBAL</span> _start 

<span style="color: #F92672; font-style: italic;">_start</span>:
        <span style="color: #66D9EF;">mov</span> eax,4            <span style="color: #465457; font-style: italic;">; </span><span style="color: #4876ff; font-style: italic;">'write' system call = 4</span>
        <span style="color: #66D9EF;">mov</span> ebx,1            <span style="color: #465457; font-style: italic;">; </span><span style="color: #4876ff; font-style: italic;">file descriptor 1 = STDOUT</span>
        <span style="color: #66D9EF;">mov</span> ecx,hello        <span style="color: #465457; font-style: italic;">; </span><span style="color: #4876ff; font-style: italic;">string to write</span>
        <span style="color: #66D9EF;">mov</span> edx,helloLen     <span style="color: #465457; font-style: italic;">; </span><span style="color: #4876ff; font-style: italic;">length of string to write</span>
        <span style="color: #66D9EF;">int</span> 80h              <span style="color: #465457; font-style: italic;">; </span><span style="color: #4876ff; font-style: italic;">call the kernel</span>

        <span style="color: #465457; font-style: italic;">; </span><span style="color: #4876ff; font-style: italic;">Terminate program</span>
        <span style="color: #66D9EF;">mov</span> eax,1            <span style="color: #465457; font-style: italic;">; </span><span style="color: #4876ff; font-style: italic;">'exit' system call</span>
        <span style="color: #66D9EF;">mov</span> ebx,0            <span style="color: #465457; font-style: italic;">; </span><span style="color: #4876ff; font-style: italic;">exit with error code 0</span>
        <span style="color: #66D9EF;">int</span> 80h              <span style="color: #465457; font-style: italic;">; </span><span style="color: #4876ff; font-style: italic;">call the kernel</span>
</code></pre>
</div>
</section>
<section id="slide-org735999a">
<h3 id="org735999a">Look familiar?</h3>
<small>
<div class="org-src-container">

<pre  class="src src-asm"><code trim><span style="color: #F92672; font-style: italic;">class</span> <span style="color: #66D9EF;">Hello</span> {
  <span style="color: #66D9EF;">Hello</span>()<span style="color: #465457; font-style: italic;">;</span>
    <span style="color: #66D9EF;">Code</span>:
       <span style="color: #66D9EF;">0</span>: aload_0
       <span style="color: #66D9EF;">1</span>: invokespecial #1  <span style="color: #465457; font-style: italic;">// </span><span style="color: #4876ff; font-style: italic;">Method java/lang/Object."&lt;init&gt;":()V</span>
       <span style="color: #66D9EF;">4</span>: return

  <span style="color: #66D9EF;">int</span> main()<span style="color: #465457; font-style: italic;">;</span>
    <span style="color: #66D9EF;">Code</span>:
       <span style="color: #66D9EF;">0</span>: getstatic     #7  <span style="color: #465457; font-style: italic;">// </span><span style="color: #4876ff; font-style: italic;">Field java/lang/System.out:Ljava/io/PrintStream;</span>
       <span style="color: #66D9EF;">3</span>: ldc           #13 <span style="color: #465457; font-style: italic;">// </span><span style="color: #4876ff; font-style: italic;">String hello, world!</span>
       <span style="color: #66D9EF;">5</span>: invokevirtual #15 <span style="color: #465457; font-style: italic;">// </span><span style="color: #4876ff; font-style: italic;">Method java/io/PrintStream.println:(Ljava/lang/String;)V</span>
       <span style="color: #66D9EF;">8</span>: iconst_0
       <span style="color: #66D9EF;">9</span>: ireturn
}
</code></pre>
</div>
</small>
</section>
<section id="slide-orgeef1f9d">
<h3 id="orgeef1f9d">Also it is made of software</h3>
<p>
<a href="https://hg.openjdk.java.net/jdk/jdk15/file/b9e3a25945f0">https://hg.openjdk.java.net/jdk/jdk15/file/b9e3a25945f0</a>
</p>
<small>
<div class="org-src-container">

<pre  class="src src-c++"><code trim><span style="color: #66D9EF;">void</span> <span style="color: #AE81FF;">ClassFileParser</span>::<span style="color: #F92672; font-style: italic;">parse_constant_pool_entries</span>(<span style="color: #66D9EF;">const</span> <span style="color: #66D9EF;">ClassFileStream</span>* <span style="color: #66D9EF;">const</span> <span style="color: #F92672;">stream</span>,
                                               <span style="color: #66D9EF;">ConstantPool</span>* <span style="color: #F92672;">cp</span>,
                                               <span style="color: #66D9EF;">const</span> <span style="color: #66D9EF;">int</span> <span style="color: #F92672;">length</span>,
                                               TRAPS) {
...
</code></pre>
</div>
</small>
<p>
via <a href="https://hg.openjdk.java.net/jdk/jdk15/file/b9e3a25945f0/src/hotspot/share/classfile/classFileParser.cpp">src/hotspot/share/classfile/classFileParser.cpp</a>
</p>
</section>
<section id="slide-org644bb7b">
<h3 id="org644bb7b">Lets do that again but in Kotlin</h3>
<p>
Which is <a href="https://github.com/JetBrains/kotlin/tree/master/compiler/backend/src/org/jetbrains/kotlin/codegen"><span class="underline">mostly</span> self-hosting</a>!
</p>
<div class="org-src-container">

<pre  class="src src-kotlin"><code trim><span style="color: #66D9EF;">class</span> <span style="color: #66D9EF;">TailRecursionCodegen</span>(
   <span style="color: #66D9EF;">private</span> <span style="color: #66D9EF;">val</span> <span style="color: #F92672;">context</span>: <span style="color: #66D9EF;">MethodContext</span>,
   <span style="color: #66D9EF;">private</span> <span style="color: #66D9EF;">val</span> <span style="color: #F92672;">codegen</span>: <span style="color: #66D9EF;">ExpressionCodegen</span>,
   <span style="color: #66D9EF;">private</span> <span style="color: #66D9EF;">val</span> <span style="color: #F92672;">v</span>: <span style="color: #66D9EF;">InstructionAdapter</span>,
   <span style="color: #66D9EF;">private</span> <span style="color: #66D9EF;">val</span> <span style="color: #F92672;">state</span>: <span style="color: #66D9EF;">GenerationState</span>
) {
</code></pre>
</div>
</section>
</section>
<section>
<section id="slide-org42dd119">
<h2 id="org42dd119">Mal in kotlin</h2>
<p>
<b>Caveat</b> — This was a learning exercise, shonky code ahead!
</p>
</section>
<section id="slide-orgb834275">
<h3 id="orgb834275">Features of Kotlin used in Mal …</h3>
<div class="outline-text-3" id="text-orgb834275">
</div>
</section>
<section id="slide-org5350896">
<h4 id="org5350896">Safe casting with polymorphic objects (so useful!)</h4>
<div class="org-src-container">

<pre  class="src src-kotlin"><code trim><span style="color: #66D9EF;">when</span>(seq) {
    <span style="color: #66D9EF;">is</span> <span style="color: #66D9EF;">MalList</span>   -&gt; malListOf(rest.reversed() + seq.atoms)
    <span style="color: #66D9EF;">else</span>         -&gt; <span style="color: #66D9EF;">MalVector</span>(seq.atoms + rest)
}
</code></pre>
</div>
</section>
<section id="slide-org6392e39">
<h4 id="org6392e39">Functions all the things</h4>
<div class="org-src-container">

<pre  class="src src-kotlin"><code trim><span style="color: #66D9EF;">fun</span> <span style="color: #66D9EF;">READ</span>(s: <span style="color: #66D9EF;">String</span>) = read_str(s)
</code></pre>
</div>
</section>
