malleability.org
***  Data classes
       #+BEGIN_SRC kotlin
       data class MalNumber(val num: Int) : MalType
       data class MalSymbol(val sym: String) : MalType
       data class MalBoolean(val bool: Boolean) : MalType
       #+END_SRC
***  When when when
       #+BEGIN_SRC shell
       § ag -F 'when(' impls/kotlin/ | wc -l
       38
       #+END_SRC
***  Type inference
       #+BEGIN_SRC shell
       § ag 'val \w+ :' impls/kotlin/src/ | wc -l
        5
       § ag 'val \w+ =' impls/kotlin/src/ | wc -l
        177
       #+END_SRC
***  Lambdas
       #+BEGIN_SRC kotlin
        to_fun("concat") {
            malListOf(it.atoms.flatMap { (it as MalSeq).atoms })
        },
       #+END_SRC
** Not much code to get going
   This is only for the self-hosting and dependent files.
   #+BEGIN_SRC shell
   § scc impls/kotlin/src/
────────────────────────────────────────────────────────────────
Language    Files     Lines   Blanks  Comments   Code Complexity
────────────────────────────────────────────────────────────────
Kotlin          7       983       96       100    787        124
────────────────────────────────────────────────────────────────
   #+END_SRC
** Largely immutable
   Use cases for mutability are few and far between (fortunately)
   #+BEGIN_SRC shell
   § ag -i mutable impls/kotlin/
   impls/kotlin/src/mal/env.kt
   7:    val data : MutableMap<MalSymbol, MalType> = mutableMapOf()
   
   impls/kotlin/src/mal/reader.kt
   112:    val map : MutableMap<MalKey, MalType> = mutableMapOf()
   143:    val list : MutableList<MalType> = mutableListOf()
   #+END_SRC
* Crash course in Lisp
  #+BEGIN_SRC clojure
    (println "the answer is " (+ 40 2))

    (defun factorial [n]
      (if (= n 0)
        1
        (* n (factorial (- n 1)))))
  #+END_SRC
  There's a [[https://erkin.party/blog/200715/evolution/][rabbit hole there]] of course.
** A few things to consider
   - Parentheses are a thing.
   - Blame [[https://en.wikipedia.org/wiki/Alonzo_Church][Alonzo Church]] ([[https://en.wikipedia.org/wiki/Lambda_calculus][lambda calculus]] ([[https://en.wikipedia.org/wiki/Foundations_of_mathematics][or Hilbert]]))
   - One of the first languages ([[https://en.wikipedia.org/wiki/Fortran][Formula Translation]] came first)
** [[http://www-formal.stanford.edu/jmc/recursive.pdf][Symbols not instructions]]
     #+BEGIN_QUOTE
     In the course of its development the LISP system went through
     several stages of simplification and eventually came to be based
     on a scheme for representing the partial recursive functions of a
     certain class of symbolic expressions.
     #+END_QUOTE
** [[http://queue.acm.org/detail.cfm?id=1039523][Maxwell's equations of software]]
   To quote [[https://en.wikipedia.org/wiki/Alan_Kay][Alan Kay]] aka OO pioneer
   #+BEGIN_QUOTE
   That was the big revelation to me when I was in graduate
   school—when I finally understood that the half page of code on the
   bottom of page 13 of the Lisp 1.5 manual was Lisp in itself. These
   were “Maxwell’s Equations of Software!” This is the whole world of
   programming in a few lines that I can put my hand over.
   #+END_QUOTE
** Just lists ... sorta
   Again to quote [[http://www-formal.stanford.edu/jmc/recursive.pdf][that paper]]:
   #+BEGIN_QUOTE
   We shall first define a class of symbolic expressions in terms of
   ordered pairs and lists.
   #+END_QUOTE
   Which gets you [[https://en.wikipedia.org/wiki/Homoiconicity][homoiconicity]] … but isn't great for data structures.
** Cheap macros
   Look, ma, no preprocessor!
   #+BEGIN_SRC clojure
     (defmacro! ->
       (fn* (x & xs)
         (reduce _iter-> x xs)))

     (def! _iter->
       (fn* [acc form]
         (if (list? form)
           `(~(first form) ~acc ~@(rest form))
           (list form acc))))

     ;; Thread initial value into first position of all subsequent calls.

     (-> (list 7 8 9) rest (rest) first (+ 7))
   #+END_SRC
