malleability.html
<section id="slide-orgff34d1c">
<h4 id="orgff34d1c">Data classes</h4>
<div class="org-src-container">

<pre  class="src src-kotlin"><code trim><span style="color: #66D9EF;">data</span> <span style="color: #66D9EF;">class</span> <span style="color: #66D9EF;">MalNumber</span>(<span style="color: #66D9EF;">val</span> <span style="color: #F92672;">num</span>: <span style="color: #66D9EF;">Int</span>) : <span style="color: #66D9EF;">MalType</span>
<span style="color: #66D9EF;">data</span> <span style="color: #66D9EF;">class</span> <span style="color: #66D9EF;">MalSymbol</span>(<span style="color: #66D9EF;">val</span> <span style="color: #F92672;">sym</span>: <span style="color: #66D9EF;">String</span>) : <span style="color: #66D9EF;">MalType</span>
<span style="color: #66D9EF;">data</span> <span style="color: #66D9EF;">class</span> <span style="color: #66D9EF;">MalBoolean</span>(<span style="color: #66D9EF;">val</span> <span style="color: #F92672;">bool</span>: <span style="color: #66D9EF;">Boolean</span>) : <span style="color: #66D9EF;">MalType</span>
</code></pre>
</div>
</section>
<section id="slide-org51cd908">
<h4 id="org51cd908">When when when</h4>
<div class="org-src-container">

<pre  class="src src-shell"><code trim>&#167; ag -F <span style="color: #E6DB74;">'when('</span> impls/kotlin/ | wc -l
38
</code></pre>
</div>
</section>
<section id="slide-orgb462b50">
<h4 id="orgb462b50">Type inference</h4>
<div class="org-src-container">

<pre  class="src src-shell"><code trim>&#167; ag <span style="color: #E6DB74;">'val \w+ :'</span> impls/kotlin/src/ | wc -l
 5
&#167; ag <span style="color: #E6DB74;">'val \w+ ='</span> impls/kotlin/src/ | wc -l
 177
</code></pre>
</div>
</section>
<section id="slide-org3459566">
<h4 id="org3459566">Lambdas</h4>
<div class="org-src-container">

<pre  class="src src-kotlin"><code trim>to_fun(<span style="color: #E6DB74;">"concat"</span>) {
    malListOf(<span style="color: #66D9EF;">it</span>.atoms.flatMap { (<span style="color: #66D9EF;">it</span> <span style="color: #66D9EF;">as</span> <span style="color: #66D9EF;">MalSeq</span>).atoms })
},
</code></pre>
</div>
</section>
<section id="slide-orga307d12">
<h3 id="orga307d12">Not much code to get going</h3>
<p>
This is only for the self-hosting and dependent files.
</p>
<div class="org-src-container">

<pre  class="src src-shell"><code trim>   &#167; scc impls/kotlin/src/
&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;
Language    Files     Lines   Blanks  Comments   Code Complexity
&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;
Kotlin          7       983       96       100    787        124
&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;&#9472;
</code></pre>
</div>
</section>
<section id="slide-org9723596">
<h3 id="org9723596">Largely immutable</h3>
<p>
Use cases for mutability are few and far between (fortunately)
</p>
<div class="org-src-container">

<pre  class="src src-shell"><code trim>&#167; ag -i mutable impls/kotlin/
impls/kotlin/src/mal/env.kt
7:    val data : MutableMap&lt;MalSymbol, MalType&gt; = mutableMapOf()

impls/kotlin/src/mal/reader.kt
112:    val map : MutableMap&lt;MalKey, MalType&gt; = mutableMapOf()
143:    val list : MutableList&lt;MalType&gt; = mutableListOf()
</code></pre>
</div>
</section>
</section>
<section>
<section id="slide-orge71da98">
<h2 id="orge71da98">Crash course in Lisp</h2>
<div class="org-src-container">

<pre  class="src src-clojure"><code trim><span style="color: #C4BE89;">(</span>println <span style="color: #E6DB74;">"the answer is "</span> <span style="color: #FD971F;">(</span>+ 40 2<span style="color: #FD971F;">)</span><span style="color: #C4BE89;">)</span>

<span style="color: #C4BE89;">(</span><span style="color: #66D9EF;">defun</span> <span style="color: #F92672; font-style: italic;">factorial</span> <span style="color: #FD971F;">[</span>n<span style="color: #FD971F;">]</span>
  <span style="color: #FD971F;">(</span><span style="color: #66D9EF;">if</span> <span style="color: #EF5939;">(</span>= n 0<span style="color: #EF5939;">)</span>
    1
    <span style="color: #EF5939;">(</span>* n <span style="color: #F92672;">(</span>factorial <span style="color: #960050;">(</span>- n 1<span style="color: #960050;">)</span><span style="color: #F92672;">)</span><span style="color: #EF5939;">)</span><span style="color: #FD971F;">)</span><span style="color: #C4BE89;">)</span>
</code></pre>
</div>
<p>
There's a <a href="https://erkin.party/blog/200715/evolution/">rabbit hole there</a> of course.
</p>
</section>
<section id="slide-org97159cc">
<h3 id="org97159cc">A few things to consider</h3>
<ul>
<li>Parentheses are a thing.</li>
<li>Blame <a href="https://en.wikipedia.org/wiki/Alonzo_Church">Alonzo Church</a> (<a href="https://en.wikipedia.org/wiki/Lambda_calculus">lambda calculus</a> (<a href="https://en.wikipedia.org/wiki/Foundations_of_mathematics">or Hilbert</a>))</li>
<li>One of the first languages (<a href="https://en.wikipedia.org/wiki/Fortran">Formula Translation</a> came first)</li>

</ul>
</section>
<section id="slide-org4871053">
<h3 id="org4871053"><a href="http://www-formal.stanford.edu/jmc/recursive.pdf">Symbols not instructions</a></h3>
<blockquote >
<p>
In the course of its development the LISP system went through
several stages of simplification and eventually came to be based
on a scheme for representing the partial recursive functions of a
certain class of symbolic expressions.
</p>
</blockquote>
</section>
<section id="slide-org52abf94">
<h3 id="org52abf94"><a href="http://queue.acm.org/detail.cfm?id=1039523">Maxwell's equations of software</a></h3>
<p>
To quote <a href="https://en.wikipedia.org/wiki/Alan_Kay">Alan Kay</a> aka OO pioneer
</p>
<blockquote >
<p>
That was the big revelation to me when I was in graduate
school—when I finally understood that the half page of code on the
bottom of page 13 of the Lisp 1.5 manual was Lisp in itself. These
were “Maxwell’s Equations of Software!” This is the whole world of
programming in a few lines that I can put my hand over.
</p>
</blockquote>
</section>
<section id="slide-orgba6f6d4">
<h3 id="orgba6f6d4">Just lists &#x2026; sorta</h3>
<p>
Again to quote <a href="http://www-formal.stanford.edu/jmc/recursive.pdf">that paper</a>:
</p>
<blockquote >
<p>
We shall first define a class of symbolic expressions in terms of
ordered pairs and lists.
</p>
</blockquote>
<p>
Which gets you <a href="https://en.wikipedia.org/wiki/Homoiconicity">homoiconicity</a> … but isn't great for data structures.
</p>
</section>
<section id="slide-orgca64ea1">
<h3 id="orgca64ea1">Cheap macros</h3>
<p>
Look, ma, no preprocessor!
</p>
<div class="org-src-container">

<pre  class="src src-clojure"><code trim><span style="color: #C4BE89;">(</span><span style="color: #66D9EF;">defmacro!</span> <span style="color: #F92672; font-style: italic;">-&gt;</span>
  <span style="color: #FD971F;">(</span><span style="color: #66D9EF;">fn*</span> <span style="color: #EF5939;">(</span>x &amp; xs<span style="color: #EF5939;">)</span>
    <span style="color: #EF5939;">(</span>reduce _iter-&gt; x xs<span style="color: #EF5939;">)</span><span style="color: #FD971F;">)</span><span style="color: #C4BE89;">)</span>

<span style="color: #C4BE89;">(</span><span style="color: #66D9EF;">def!</span> <span style="color: #F92672; font-style: italic;">_iter-&gt;</span>
  <span style="color: #FD971F;">(</span><span style="color: #66D9EF;">fn*</span> <span style="color: #EF5939;">[</span>acc form<span style="color: #EF5939;">]</span>
    <span style="color: #EF5939;">(</span><span style="color: #66D9EF;">if</span> <span style="color: #F92672;">(</span>list? form<span style="color: #F92672;">)</span>
      `<span style="color: #F92672;">(</span>~<span style="color: #960050;">(</span>first form<span style="color: #960050;">)</span> ~acc ~@<span style="color: #960050;">(</span>rest form<span style="color: #960050;">)</span><span style="color: #F92672;">)</span>
      <span style="color: #F92672;">(</span>list form acc<span style="color: #F92672;">)</span><span style="color: #EF5939;">)</span><span style="color: #FD971F;">)</span><span style="color: #C4BE89;">)</span>

<span style="color: #465457; font-style: italic;">;; </span><span style="color: #4876ff; font-style: italic;">Thread initial value into first position of all subsequent calls.</span>

<span style="color: #C4BE89;">(</span><span style="color: #66D9EF;">-&gt;</span> <span style="color: #FD971F;">(</span>list 7 8 9<span style="color: #FD971F;">)</span> rest <span style="color: #FD971F;">(</span>rest<span style="color: #FD971F;">)</span> first <span style="color: #FD971F;">(</span>+ 7<span style="color: #FD971F;">)</span><span style="color: #C4BE89;">)</span>
</code></pre>
</div>
</section>
</section>
